index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-14 Sat 19:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Senthil Kumaran's Projects</title>
<meta name="author" content="Kumaran" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="imagine.css" />
<base target="_blank">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Senthil Kumaran's Projects</h1>

<div id="outline-container-org52dcdd9" class="outline-2">
<h2 id="org52dcdd9">Software</h2>
<div class="outline-text-2" id="text-org52dcdd9">
</div>
<div id="outline-container-orgc2ffeb4" class="outline-3">
<h3 id="orgc2ffeb4">LearnToSolveIt&#xa0;&#xa0;&#xa0;<span class="tag"><span class="c">c</span>&#xa0;<span class="python">python</span>&#xa0;<span class="docs">docs</span></span></h3>
<div class="outline-text-3" id="text-orgc2ffeb4">
</div>
<div id="outline-container-orga3db7f4" class="outline-4">
<h4 id="orga3db7f4"><a href="https://www.learntosolveit.com/">https://www.learntosolveit.com/</a></h4>
<div class="outline-text-4" id="text-orga3db7f4">
<p>
This was my first project, aimed to help me learn C programming language. It has
survived for 20 years, and I have been updating it periodically. I have to
finish this with the C Code with proper understanding.
</p>
</div>
</div>
</div>

<div id="outline-container-org7d6baa4" class="outline-3">
<h3 id="org7d6baa4">CPython&#xa0;&#xa0;&#xa0;<span class="tag"><span class="python">python</span>&#xa0;<span class="ci">ci</span>&#xa0;<span class="git">git</span></span></h3>
<div class="outline-text-3" id="text-org7d6baa4">
</div>
<div id="outline-container-orgae4b1c8" class="outline-4">
<h4 id="orgae4b1c8"><a href="https://github.com/python/cpython/pulls/orsenthil">https://github.com/python/cpython/pulls/orsenthil</a></h4>
</div>
<div id="outline-container-org1c6caa1" class="outline-4">
<h4 id="org1c6caa1"><a href="https://buildbot.python.org/all/#/workers/43">https://buildbot.python.org/all/#/workers/43</a></h4>
<div class="outline-text-4" id="text-org1c6caa1">
<p>
I am a Cpython hacker. I got involved during Python2 to Python3 development. I
contributed to urllib, and urlparse modules. I also contributed to migration of
python repo from mercurial to git.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf2571b8" class="outline-3">
<h3 id="orgf2571b8">Eksctl-Explorer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="kubernetes">kubernetes</span></span></h3>
<div class="outline-text-3" id="text-orgf2571b8">
</div>
<div id="outline-container-org3080747" class="outline-4">
<h4 id="org3080747"><a href="https://eksctl.learntosolveit.com/">https://eksctl.learntosolveit.com/</a></h4>
<div class="outline-text-4" id="text-org3080747">
<p>
Website to explore eksctl setup commands. It provides the manifest examples that
be used directly.
</p>
</div>
</div>
</div>

<div id="outline-container-org55fafa5" class="outline-3">
<h3 id="org55fafa5">Fortune Browser Extension&#xa0;&#xa0;&#xa0;<span class="tag"><span class="javascript">javascript</span>&#xa0;<span class="python">python</span>&#xa0;<span class="datastore">datastore</span></span></h3>
<div class="outline-text-3" id="text-org55fafa5">
</div>
<div id="outline-container-org5370304" class="outline-4">
<h4 id="org5370304"><a href="https://github.com/orsenthil/fortune-browser-extension">https://github.com/orsenthil/fortune-browser-extension</a></h4>
<div class="outline-text-4" id="text-org5370304">
<p>
It is my collection of quotes that is displayed with a new browser tabs. I
enjoy reading them, and adding to the collection.
</p>
</div>
</div>
</div>


<div id="outline-container-org456353a" class="outline-3">
<h3 id="org456353a">Blog&#xa0;&#xa0;&#xa0;<span class="tag"><span class="python">python</span>&#xa0;<span class="nikola">nikola</span></span></h3>
<div class="outline-text-3" id="text-org456353a">
</div>
<div id="outline-container-org516b893" class="outline-4">
<h4 id="org516b893"><a href="https://senthil.learntosolveit.com/">https://senthil.learntosolveit.com/</a></h4>
<div class="outline-text-4" id="text-org516b893">
<p>
My blog is built with Python Nikola Framework, it has technical articles,
opinions on politics, self-help and my reviews on books.
</p>
</div>
</div>
</div>

<div id="outline-container-orgad1b878" class="outline-3">
<h3 id="orgad1b878">Minecraft Server&#xa0;&#xa0;&#xa0;<span class="tag"><span class="minecraft">minecraft</span>&#xa0;<span class="docker">docker</span></span></h3>
<div class="outline-text-3" id="text-orgad1b878">
</div>
<div id="outline-container-org75026e8" class="outline-4">
<h4 id="org75026e8"><a href="https://mc.learntosolveit.com/">https://mc.learntosolveit.com/</a></h4>
<div class="outline-text-4" id="text-org75026e8">
<p>
We host a minecraft server, called Occamy Minecraft Server. My children build
some amazing creations in the minecraft.
</p>
</div>
</div>
</div>

<div id="outline-container-org5a19e1d" class="outline-3">
<h3 id="org5a19e1d">Mastodon&#xa0;&#xa0;&#xa0;<span class="tag"><span class="docker">docker</span></span></h3>
<div class="outline-text-3" id="text-org5a19e1d">
</div>
<div id="outline-container-org47f79a0" class="outline-4">
<h4 id="org47f79a0"><a href="https://social.learntosolveit.com/home">https://social.learntosolveit.com/home</a></h4>
<div class="outline-text-4" id="text-org47f79a0">
<p>
I host a Mastodon instance for myself. It is a microblogging service, federated
universe where you can follow people from other instances and exchange amazing
ideas.
</p>
</div>
</div>
</div>


<div id="outline-container-org9993970" class="outline-3">
<h3 id="org9993970">Courses Documentation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="python">python</span>&#xa0;<span class="sphinx">sphinx</span></span></h3>
<div class="outline-text-3" id="text-org9993970">
</div>
<div id="outline-container-orgc12fb11" class="outline-4">
<h4 id="orgc12fb11"><a href="https://courses.learntosolveit.com/">https://courses.learntosolveit.com/</a></h4>
<div class="outline-text-4" id="text-orgc12fb11">
<p>
I have taken extensive notes, and maintained them during various classes I have
taken online. This is helpful to many students. The website also consists of my
notes from Georgia Tech OMSCS course.
</p>
</div>
</div>
</div>

<div id="outline-container-org8894aaa" class="outline-3">
<h3 id="org8894aaa">Private Trading Application&#xa0;&#xa0;&#xa0;<span class="tag"><span class="python">python</span></span></h3>
<div class="outline-text-3" id="text-org8894aaa">
</div>
<div id="outline-container-org8da4b96" class="outline-4">
<h4 id="org8da4b96"><a href="https://github.com/orsenthil/trading">https://github.com/orsenthil/trading</a></h4>
<div class="outline-text-4" id="text-org8da4b96">
<p>
I employ some options trading strategies to derive benefits. I have written code
to automate trading. This is for single person, personal use only.
</p>
</div>
</div>
</div>

<div id="outline-container-org499983b" class="outline-3">
<h3 id="org499983b">Kubectl Explorer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="javascript">javascript</span></span></h3>
<div class="outline-text-3" id="text-org499983b">
</div>
<div id="outline-container-org86ad1e5" class="outline-4">
<h4 id="org86ad1e5"><a href="https://kubectl.learntosolveit.com/">https://kubectl.learntosolveit.com/</a></h4>
<div class="outline-text-4" id="text-org86ad1e5">
<p>
Website to explore kubectl commands. It provides the manifest examples that can
be used directly.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf66b0ad" class="outline-3">
<h3 id="orgf66b0ad">Marriage Website&#xa0;&#xa0;&#xa0;<span class="tag"><span class="python">python</span>&#xa0;<span class="appengine">appengine</span></span></h3>
<div class="outline-text-3" id="text-orgf66b0ad">
</div>
<div id="outline-container-org3287b57" class="outline-4">
<h4 id="org3287b57"><a href="https://shalini-weds-senthil.appspot.com/MainPage">https://shalini-weds-senthil.appspot.com/MainPage</a></h4>
<div class="outline-text-4" id="text-org3287b57">
<p>
As a true hacker, I created a website for my marriage and hosted it in Google
AppEngine. You will to love the quotes on marriage that I and my wife collected.
The guest form has wishes collected from our friends.
</p>
</div>
</div>
</div>

<div id="outline-container-org0a7c5e3" class="outline-3">
<h3 id="org0a7c5e3">Discipline Score&#xa0;&#xa0;&#xa0;<span class="tag"><span class="python">python</span>&#xa0;<span class="appengine">appengine</span></span></h3>
<div class="outline-text-3" id="text-org0a7c5e3">
</div>
<div id="outline-container-org07169ca" class="outline-4">
<h4 id="org07169ca"><a href="http://discipline-score.appspot.com/">http://discipline-score.appspot.com/</a></h4>
<div class="outline-text-4" id="text-org07169ca">
<p>
This is a todo list application that I built for myself. This application was
built as my effort to keep track and improve my self-discipline.
</p>

<p>
Along with the todo, I give a rating for evey task, and score it after I
complete it. The task are time bound.
</p>

<p>
The rating helps me priorize the task, and score is a self-reflection of my
performance on the task. The application will give a score (discipline-score)
for my effort.
</p>

<p>
My goal with this application was to track and maximize my discipline score.
This application helped me. It was helpful because it was longest todo
application I struck with.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb222716" class="outline-3">
<h3 id="orgb222716">Bitcoin&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bitcoin">bitcoin</span></span></h3>
<div class="outline-text-3" id="text-orgb222716">
<p>
I have bitcoin miner running at host in US. I like the domain of cryptocurrency.
</p>
</div>
</div>

<div id="outline-container-orgab93b46" class="outline-3">
<h3 id="orgab93b46">Rapple&#xa0;&#xa0;&#xa0;<span class="tag"><span class="opensource">opensource</span>&#xa0;<span class="c">c</span></span></h3>
<div class="outline-text-3" id="text-orgab93b46">
</div>
<div id="outline-container-org4dc66c4" class="outline-4">
<h4 id="org4dc66c4"><a href="https://rapple.sourceforge.net/index.html">https://rapple.sourceforge.net/index.html</a></h4>
<div class="outline-text-4" id="text-org4dc66c4">
<p>
This was my first volunteering contribution to an Open Source project.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf8b0ce9" class="outline-2">
<h2 id="orgf8b0ce9">Sourashtra Language</h2>
<div class="outline-text-2" id="text-orgf8b0ce9">
</div>
<div id="outline-container-org8098306" class="outline-3">
<h3 id="org8098306">Yummy Sourashtra</h3>
<div class="outline-text-3" id="text-org8098306">
</div>
<div id="outline-container-org3f7ba42" class="outline-4">
<h4 id="org3f7ba42"><a href="https://yummysourashtra.com/">https://yummysourashtra.com/</a></h4>
</div>
</div>

<div id="outline-container-org7e98bcc" class="outline-3">
<h3 id="org7e98bcc">thinnal.org</h3>
<div class="outline-text-3" id="text-org7e98bcc">
</div>
<div id="outline-container-org25beac8" class="outline-4">
<h4 id="org25beac8"><a href="https://thinnal.org">https://thinnal.org</a></h4>
<div class="outline-text-4" id="text-org25beac8">
<p>
This is community website for Sourashtra language Speakers. More than 1000
members use this website. This has lead to many offshoot, standalone projects in
the community, and helped in growth of the local community.
</p>
</div>
</div>
</div>

<div id="outline-container-org5e80c04" class="outline-3">
<h3 id="org5e80c04">Sourashtra Language in Memrise</h3>
<div class="outline-text-3" id="text-org5e80c04">
</div>
<div id="outline-container-org35f25f6" class="outline-4">
<h4 id="org35f25f6"><a href="https://app.memrise.com/course/5916249/sourashtra/">https://app.memrise.com/course/5916249/sourashtra/</a></h4>
</div>
</div>

<div id="outline-container-orge8193c4" class="outline-3">
<h3 id="orge8193c4">Yummy Sourashtra Book 1</h3>
<div class="outline-text-3" id="text-orge8193c4">
<p>
My dad wrote a cook book consisting of various Sourashtra Recipes.
</p>
</div>
</div>

<div id="outline-container-org5818933" class="outline-3">
<h3 id="org5818933">Yummy Sourashtra Book 2</h3>
<div class="outline-text-3" id="text-org5818933">
<p>
My dad wrote a cook book consisting of various Sourashtra Recipes.
</p>
</div>
</div>

<div id="outline-container-org892e7e1" class="outline-3">
<h3 id="org892e7e1">Sourashtra  - Havard Kyoto Transliteration Scheme</h3>
<div class="outline-text-3" id="text-org892e7e1">
<p>
It is a transliteration scheme used for spoken Sourashtra language to writen
using latin script.
</p>
</div>
</div>
</div>

<div id="outline-container-org3d8feb3" class="outline-2">
<h2 id="org3d8feb3">Jobs</h2>
<div class="outline-text-2" id="text-org3d8feb3">
</div>
<div id="outline-container-orgb14d2e3" class="outline-4">
<h4 id="orgb14d2e3">Amazon Web Services</h4>
<div class="outline-text-4" id="text-orgb14d2e3">
<p>
I work as a Senior Systems Development Engineer in the Amazon Web Services in
the Elastic Kubernetes Service. I focus on the Container Networking domain, and
work on projects, services related to Container Networks, like VPC CNI,
Resource Controller,Kube-Proxy, CoreDNS and Load Balancer Controller.
</p>

<p>
I wrote an important service to detect security vulnerablities early for the
EKS services.
</p>
</div>
</div>

<div id="outline-container-org666e020" class="outline-4">
<h4 id="org666e020">Mesosphere / D2IQ</h4>
<div class="outline-text-4" id="text-org666e020">
<p>
As a Staff Software Engineer and Tech Lead in the Developer
Productivity Team at D2IQ, my responsiblities include design and
development of software tools to improve the software development
experience at D2IQ.  It includes designing, and developing Continous
Integration systems and jobs that are used for testing Distributed
System Software.
</p>

<p>
My job duties also includes mentoring junior developers, reviewing the
design and code.
</p>
</div>
</div>

<div id="outline-container-org08c9ae4" class="outline-4">
<h4 id="org08c9ae4">Okta</h4>
<div class="outline-text-4" id="text-org08c9ae4">
<p>
As a Senior Software Engineer in the Developer Productivity team at
Okta, my job included developing Test Automation Systems using Java
Programming language. My job responsibilities included developing a
custom developed continous integration framework in Java, using
Dropwizard.io framework and JQuery Javascript Framework. We employed
technologies like Bash scripting, Docker, Amazon Elastic Container
Service to develop the Test Automation system.
</p>

<p>
I wrote a tool to do automated deployments using software tool called
Ansible in Python programming language. As a senior engineer, my
responsibilities include reviewing code written by other engineers in
the team.
</p>
</div>
</div>

<div id="outline-container-org0893527" class="outline-4">
<h4 id="org0893527">Twitter</h4>
<div class="outline-text-4" id="text-org0893527">
<p>
Write Release and Deployment tool used for Deploying
Twitter.com. Develop BUILD tool called Pants, which uses Python
programming language and ability to build multiple software
packages. Develop git porcelain to ease the development workflow of
engineers within Twitter. Review code written by others. Design
discussions of new products for use within Twitter. Work on technical
and algorithmic aspects of large systems while assessing systems
ability to meet team members needs. Work closely with, and incorporate
feedback from, engineers from other teams at Twitter, product
management, and interaction designers. Work on the scalability,
resilience, and efficiency of backend components. Build storage
systems, libraries, and frameworks.
</p>
</div>
</div>


<div id="outline-container-orgff46e21" class="outline-4">
<h4 id="orgff46e21">Lucasfilm Singapore</h4>
<div class="outline-text-4" id="text-orgff46e21">
<p>
I worked as a Senior Software Engineer in the Information Systems team and
worked on web application that was used in movie production pipelie. The web
application was a Python web application using Pyramid framework. extensively
used Javascript, JQuery and backed was an Oracle Database.
</p>
</div>
</div>

<div id="outline-container-org0100cb8" class="outline-4">
<h4 id="org0100cb8">Akamai</h4>
<div class="outline-text-4" id="text-org0100cb8">
<p>
Akamai – March 2, 2009 – January 31, 2011
</p>

<p>
I was working as a Senior Software Engineer in the Akamai. I developed a tool
called Toolserver that used to gather logs from various services and pushed to
the mapreduce processing system. Toolserver was developed using Twisted
asynchronous Python framework.
</p>
</div>
</div>

<div id="outline-container-org80f3045" class="outline-4">
<h4 id="org80f3045">Dell India</h4>
<div class="outline-text-4" id="text-org80f3045">
<p>
I was working as a Software Engineer in Dell India R&amp;D Center, Bangalore. I
worked in the Dell OpenManage Server Administrator team. I was responsible for
developing the software that is used to manage the Dell Servers.
</p>
</div>
</div>
</div>


<div id="outline-container-org2689d94" class="outline-2">
<h2 id="org2689d94">Patents</h2>
<div class="outline-text-2" id="text-org2689d94">
</div>
<div id="outline-container-org8bc27c4" class="outline-4">
<h4 id="org8bc27c4">System and Method For Downloading Content Associated with Optical</h4>
<div class="outline-text-4" id="text-org8bc27c4">
<p>
Media US 12/342,732 · Filed Dec 23, 2008
</p>

<p>
Fast Download like mechanism for downloading content in your setup box and Blu
Ray disk.
</p>
</div>
</div>

<div id="outline-container-org4c31ced" class="outline-4">
<h4 id="org4c31ced">System and Method for Audiovisual Content Search</h4>
<div class="outline-text-4" id="text-org4c31ced">
<p>
US 11/671,535 · Filed Feb 6, 2007
</p>

<p>
A subtitle indexing engine and ability search by dialogues for the movies that
you are watching on Blu Ray disc.
</p>
</div>
</div>


<div id="outline-container-org2f01ef1" class="outline-4">
<h4 id="org2f01ef1">System and method for printer-based syndication</h4>
<div class="outline-text-4" id="text-org2f01ef1">
<p>
US 11/087,966  Filed Mar 23, 2005
</p>

<p>
Idea for RSS support with printer firmware so that customized newspapers can be
scheduled for delivery morning to your house.
</p>
</div>
</div>

<div id="outline-container-orgac52842" class="outline-4">
<h4 id="orgac52842">Obtaining user input for inclusion in system management logs</h4>
<div class="outline-text-4" id="text-orgac52842">
<p>
US 11/008,443 · Filed Dec 9, 2004
</p>

<p>
Idea to include log messages written by system administrators with System log
generated by services.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kumaran</p>
<p class="date">Created: 2023-10-14 Sat 19:26</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>